# Dawid Woźniak

#### W tym zadaniu musiałem stworzyć jeden z podstawowych obiektów biblioteki pandas czyli ramke danych - DataFrame. Ramka jest uzupełniona 5 dowolnymi rekordami, gdzie każdy rekord zgodnie z poleceniem zawiera Feature: name,surname,age oraz sex. Następnie za pomocą takich funkcji jak pd.info(), czy pd.describe(), możemy zobaczyć jakie typy danych mamy w naszej ramce, czy są jakieś obiekty typu Nan oraz opis statystyczny naszych danych(Średnia mediana itd.). Ostatnią rzeczą było wyświetlenie 3 pierwszych rekordów za pomocą polecenia pd.head(). Jest to szczególnie przydatne gdy pracujemy na dużych ramkach danych, i chchemy podejrzeć tylko pare rekordów.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(data =
                 {'name': ['Dawid','Adam','Jadwiga','Kamil','Wojtek'],
                 'surname': ['Kowalski','Nowak','Frankowski','Chrobry','Odnowiciel'],
                 'age': [12,24,63,26,68],
                 'sex': ['M','M','F','M','M']})

In [3]:
df

      name     surname  age sex
0    Dawid    Kowalski   12   M
1     Adam       Nowak   24   M
2  Jadwiga  Frankowski   63   F
3    Kamil     Chrobry   26   M
4   Wojtek  Odnowiciel   68   M

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      int64
 3   sex      5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [6]:
df.describe()

             age
count   5.000000
mean   38.600000
std    25.195238
min    12.000000
25%    24.000000
50%    26.000000
75%    63.000000
max    68.000000

In [7]:
df.head(3)

      name     surname  age sex
0    Dawid    Kowalski   12   M
1     Adam       Nowak   24   M
2  Jadwiga  Frankowski   63   F